BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>eOMMEERIeyCEtY6pSAJ1rPq2fMmwyu2E0+ULaFc1oe/RJUuX7K/6wiZ4Fx6xBQgH1HLWQ9tab6/9&#13;
hqs1xm7mlwO2Gq8meRg+KuD1HcnulTvaPqhLdQ3sLKGIyPPNNTQkvqqYvjZnUQP3THPt1Zkd0bdH&#13;
0KRSQgfncumshg5BbEGIr4zzo+HF3AdOxSi+/T1VjQd/vxG4BjZgH8BGiWqgwHwBp9BKwmgoMixS&#13;
IpUtbNJZfD9l/GfH4gu3BgNB3F0nhjXx0QRZuNM3lomgelrfh+7k+fj3JoDtYExO60qxg4csx4Ui&#13;
Ml9JRRZacdYI4h8p77ugTcPZYPS70SmuwpQebQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>GP5Gr9vfWGegY2cPycut06TqEGFfMHJVN0SPbIvwPb3s0sCzfZeFH6jr3kF/FlCIdyu7fFjtx7st&#13;
WaxdBBS+LK2Exfd1jrzh1PdJWK2Z6IP0haQK4POMekdRLSlXXA+LN9W5MrkT6Wrave9dqvZ6b64U&#13;
34QI0pF/caoTa9iCxhVdbAXHf3klPWi5aB78q13CoRzDexvivAAnPg5gAK0yTvQD+mQJfTBW7yM0&#13;
AD8XVi+C1WEFeZnb56V5qkkmKkU1c+Cm01QqhAyO47kO0iEdlk2zojhJ/7Z/rdDjt2GcQfoc7ycR&#13;
5nkGymeQGM41LzAvUlnKQATcTEFpB0zo31/SDc34tx+I3tw9rz7RQXALTwbqgCjQUlSczosd7YK+&#13;
CGyhztFLC4G/S5svODL+3/HSlfbHU9CcK7LpDToRqGr9Uvj8EhAQPOLhwTaYpairuPuWFCB975G7&#13;
hX6omR7+wJOOG3aF+DXU6cQwS0MTZrBR6wJq5uUiNzV1VYDxhlvRd1gguUdr76mW6n/b1K4h15ZA&#13;
3WTTTu1bwK9nDug2AMS0vjwnUPvUL+CVcw6niEKVhbQjgwkL7EVFD50YS+pC3ftLg+sObmhKlejI&#13;
hV7pyvtsje6H1ZYSA/PXK3lzS/3qoAVmcesi7N0GclIsUr7uADHgtY2rSFrBIFkpFFxMBPKwoRjD&#13;
M0dYyEKAocJ4VHi80h8uyBxlQzVqB6P6IuBRz9m6mwYLzJRbPsHAvlrA+bqaHT4uOXiOEwlNOLtr&#13;
NFCFg5ZqE+n8/1vScPWNhRsHxWR9SaQtHH8sI0xmPUNUfVY0uHCqEbppvTlu4ZQfmUG2jKNtv/Q6&#13;
1x6lMWcrk+Iy3BW95M+wjKMG6LMLEkbXSHvCCQ0gaoX54OCJb6+GOeIwkgRvGW8H3GhES9kKcWPW&#13;
tTFTntaOo7TZ68LO2r6YNPro1Tub5G85p+nmoccQOlymyK+HmVlNhnrFZy1peWVT9Vy7abqozAD1&#13;
+Br7PqqjC6u/Ryj+TKPLH/68qYWG6Fk/nGYjhPODSd+Va3hIwTidKmzJ7TMu4XOXVmYUVyWfqose&#13;
aEMGmcqxHnbCBocTGu283DKyZmhQLUpKJ0ptDiQwoAuAOfFtZToRKiqdXmKtb/kF3AynO+nnWPw6&#13;
Z68m3kl6Gw8BjMsHBeGXXsXuliyq8sKFhJUMi1XlS8v3z9+XDgIiphBc55rJMw8of6GefAcVNS+G&#13;
38EwV3Mkmayp0RrvKOVOmU5w1wd599tokuH8HRk7M/1YAWx8xLmIpEVjkilkBmgWSbOEdJeKRW5C&#13;
bTd2hAdxFlLsju7L2D11ftGHN3f23YTDIGRitXSfc9TUTm6bZoSRexLcTnq/RyJeogo/gqT9jw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>LfPJAWATMOcE/MSd6H3Zme0CPH0=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Ws08WG6I3Fq7ZBX//VbYIp4HTNLcX2zGlZ03QtdDTxGOCUjO6a9VhJVpRI9rmPQby8u5Oqy7JyJJ&#13;
y2rT2eHs5j9BhbNL21P5Izu0UQ73xn5rkSD6xIii2ZlpULcJ3Mc8EmYx7wtRVhb0ZGPcoiBLzbrk&#13;
/4hXgkfbE5DYYjlxyhZ5s+1Un0T8ImljUtikgiX5ayBj8nCGBEAGno3aYbg4iir7uhoh/Kz+a6n/&#13;
CRYh57n+QPeK+SEKN6TtjLDTQ7qRQAy8+2KlSbwVYXNAInedxHsxVAJz+5blk4quzJIqY9uJh/Z2&#13;
rDngRH09xrwidPz2C0PS6RWktrKEO2qmBG+tzQ==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>